{
    "1": "Tell me about yourself.",
    "2":"What are your strengths?",
    "3":"What are your weaknesses?",
    "4":"Why do you want this job?",
    "5":"Where would you like to be in your career five years from now?",
    "6":"What's your ideal company?",
    "7":"What attracted you to this company?",
    "8":"Why should we hire you?",
    "9":"What did you like least about your last job?",
    "10":"When were you most satisfied in your job?",
    "11":"What can you do for us that other candidates can't?",
    "12":"What were the responsibilities of your last position?",
    "13":"Why are you leaving your present job?",
    "14":"What do you know about this industry?",
    "15":"What do you know about our company?",
    "16":"Are you willing to relocate?",
    "17":"Do you have any questions for me?",
    "18":"What was the last project you led, and what was its outcome?",
    "19":"Give me an example of a time that you felt you went above and beyond the call of duty at work.",
    "20":"Can you describe a time when your work was criticized?",
    "21":"Have you ever been on a team where someone was not pulling their own weight? How did you handle it?",
    "22":"Tell me about a time when you had to give someone difficult feedback. How did you handle it?", 
    "23":"What is your greatest failure, and what did you learn from it?",
    "24":"How do you handle working with people who annoy you?",
    "25":"If I were your supervisor and asked you to do something that you disagreed with, what would you do?",
    "26":"What was the most difficult period in your life, and how did you deal with it?",
    "27":"Give me an example of a time you did something wrong. How did you handle it?",
    "28":"Tell me about a time where you had to deal with conflict on the job.",
    "29":"If you were at a business lunch and you ordered a rare steak and they brought it to you well done, what would you do?",
    "30":"If you found out your company was doing something against the law, like fraud, what would you do?",
    "31":"What assignment was too difficult for you, and how did you resolve the issue?",
    "32":"What's the most difficult decision you've made in the last two years and how did you come to that decision?",
    "33":"Describe how you would handle a situation if you were required to finish multiple tasks by the end of the day, and there was no conceivable way that you could finish them."
}